In [91]:
import pandas as pd

# Series

In [92]:
data = [1,2,3,4,5]

In [93]:
s = pd.Series(data)

In [94]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [95]:
index = ['Linha' + str(i) for i in range(5)]

In [96]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [97]:
s = pd.Series(data= data, index= index)

In [98]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [99]:
data = {"Linha" + str(i) : i+1 for i in range(5)}

In [100]:
s = pd.Series(data)

In [101]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [102]:
s1 = s + 2

In [103]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [104]:
s2 = s+s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

## DataFrame

In [105]:
data = [[1,2,3],
        [4,5,6],
        [7,8,9]]

In [106]:
df1 = pd.DataFrame(data=data)

In [107]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [108]:
columns = ["Coluna" + str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [109]:
index = ['Linha' + str(i) for i in range(3)]

In [110]:
df1 = pd.DataFrame(data=data, index = index, columns = columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [111]:
df2 = pd.DataFrame(data=data, index = index, columns = columns)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [112]:
df3 = pd.DataFrame(data=data, index = index, columns = columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [113]:
df1 [df1 > 0] = "A"
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [114]:
df2 [df2 > 0] = "B"
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [115]:
df3 [df3 > 0] = "C"
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [117]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [118]:
df4 = pd.concat([df1, df2, df3], axis =1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C